//Напишите программу, которая на вход принимает число и выдает его квадрат (число умноженное на само себя).
  //  4 -> 16 
   // -3 -> 9 
   // -7 -> 49

double a = -7;
a = a * a;
Console.WriteLine("Ответ ");
Console.WriteLine(a);